Clash Bot Webapp Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.step_function.data.aws_region.current[0]: Reading...
module.step_function.data.aws_caller_identity.current: Reading...
module.step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "teamId"
      + id               = (known after apply)
      + name             = "clash-teams"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-teams"
        }
      + tags_all         = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
          + "Name"        = "clash-teams"
        }
      + write_capacity   = 5

      + attribute {
          + name = "teamId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

  # module.step_function.data.aws_iam_policy_document.service["dynamodb"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbDynamodb"
        }
    }

  # module.step_function.aws_iam_policy.service["dynamodb"] will be created
  + resource "aws_iam_policy" "service" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "retrieve-teams-dynamodb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
    }

  # module.step_function.aws_iam_policy_attachment.service["dynamodb"] will be created
  + resource "aws_iam_policy_attachment" "service" {
      + id         = (known after apply)
      + name       = "retrieve-teams-dynamodb"
      + policy_arn = (known after apply)
      + roles      = [
          + "retrieve-teams",
        ]
    }

  # module.step_function.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.us-east-1.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve-teams"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)
    }

  # module.step_function.aws_sfn_state_machine.this[0] will be created
  + resource "aws_sfn_state_machine" "this" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "retrieve-teams"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "retrieve-teams"
        }
      + tags_all                  = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
          + "Name"        = "retrieve-teams"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clash-teams-table-arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*